Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/the_irish_government/government_and_dail_eireann.html.txt.tmx
Source language: en
Languages: ga

source: Government and Dáil Éireann
ga: An Rialtas agus Dáil Éireann

source: Bunreacht na hÉireann (the Irish Constitution) states that the Government is responsible to Dáil Éireann
ga: De réir an Bhunreachta tá an Rialtas freagrach do Dháil Éireann

source: This means that the Government holds office only for as long as it keeps the support of the majority of the members of Dáil Éireann
ga: Mar sin bíonn an Rialtas in oifig an fhad agus atá tacaíocht tromlach na dteachtaí i nDáil Éireann aige

source: The Taoiseach may resign voluntarily and if he/she does, all of the Cabinet ministers are also considered to have resigned
ga: Is féidir leis an Taoiseach éirí as a p(h)ost dá t(h)oil féin, agus má dhéanann sé/sí é sin tuigtear go bhfuil na hairí ar fad sa chomh-aireacht éirithe as a bpost

source: A new nomination for Taoiseach will be put before the Dáil and the Dail will approve a new Taoiseach
ga: Cuirfear ainmniúchán nua do phost an Taoisigh ós comhair na Dála agus ceadóidh an Dáil Taoiseach nua

source: If the Taoiseach fails to keep the support of the majority of the Dáil, he or she must either resign or advise the President to dissolve the Dáil
ga: Má chailleann an Taoiseach tacaíocht tromlach na Dála, ní mór dó/dí éirí as a p(h)ost nó iarraidh ar an Uachtarán an Dáil a lánscoir

source: This may happen if a coalition government can no longer work together
ga: D'fhéadfadh sé seo tarlú i gcás comhrialtais nach mbeadh in ann a thuilleadh comhoibriú lena chéile

source: If the Dáil is dissolved, there will then be a general election
ga: Má dhéantar an Dáil a lánscoir beidh ollthoghchán ann

source: Following the election, the nomination for Taoiseach must then obtain the support of the majority of the members of the new Dáil
ga: Tar éis an ollthoghcháin ní mór go mbeadh tacaíocht tromlach na dteachtaí sa Dáil nua ag an té a ainmnítear mar Thaoiseach

source: The Government meets and acts as a collective authority and is collectively responsible for all the Departments of State
ga: Tagann an Rialtas le chéile agus feidhmíonn sé mar údarás aontaithe agus tá chomhfhreagracht ar na baill i dtaobh ranna uilig an Stáit

source: Discussions at Cabinet meetings are confidential
ga: Is faoi rún a dhéantar plé ar ábhair ag cruinnithe den chomh-aireacht

source: The Government presents a united front and all the ministers must publicly support its major policies and decisions
ga: Bíonn an Rialtas aontaithe ar pholasaithe agus ní mór do na hairí ar fad tacaíocht phoiblí a thabhairt do na polasaithe agus na cinnithe móra atá ag an Rialtas

source: The Taoiseach has the power to dismiss ministers if there is sufficient reason to do so although this power is rarely exercised
ga: Tá sé de chumhacht ag an Taoiseach airí a chur as a bpost má bhíonn cúis mhaith aige/aici ach is go fíor annamh a dhéantar é seo i ndáiríre

source: It may happen if the minister has become embroiled in some public controversy or if there is a challenge to the leadership of the party
ga: D'fhéadfadh sé tarlú dá mbeadh baint ag an aire le conspóid phoiblí nó dá mbeadh dúshlán ann do cheannaireacht an pháirtí

source: Ministers may also voluntarily resign
ga: Is féidir le airí éirí as a bpost dá ndeoin féin

source: This may happen if the minister does not agree with a Government policy
ga: D'fhéadfadh sé seo tarlú muna mbeadh aire sásta aontú le polasaí an Rialtais
